@extends('Layouts.main')

@section('title', 'Басты бет')

@section('content')
    <div style="position: relative;">
        <img style="max-width: 100%;" src="{{ asset('image/main.png') }}" alt="main-img" class="image-top">
        <img src="{{ asset('image/Vector.png') }}" alt="vector-img" class="image-bottom">
    </div>

    <div class="container-text">
        <div class="location">Санкт-Петербург</div>
        <div class="title">Котейка</div>
        <div class="subtitle">Уютная гостиница для котов и кошек</div>
        <a href="#" class="button"><p >Забронировать</p> <span><svg width="36" height="36" viewBox="0 0 36 36" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M36 18C36 22.8079 34.1277 27.3277 30.7279 30.7279C27.329 34.1268 22.8093 35.9992 18.0022 36H18C13.1921 36 8.67151 34.1277 5.27206 30.7279C1.87234 27.3277 0 22.8079 0 18C0 13.1921 1.87234 8.67151 5.27206 5.27206C8.67151 1.87234 13.1921 0 18 0H18.0022C22.8093 0.000823978 27.329 1.87317 30.7279 5.27206C34.1277 8.67151 36 13.1921 36 18Z" fill="#FF7236"/>
            <path d="M24.8031 15.5246C21.8387 17.2247 22.3435 22.1874 25.5591 22.1874C26.9459 22.1874 28.1462 21.1449 28.6806 19.812C29.9148 16.7336 27.3483 14.0644 24.8031 15.5246Z" fill="#FFFEFD"/>
            <path d="M21.7585 16.1391C25.3153 16.1391 26.3803 10.0992 23.0011 9.10622C21.4616 8.65395 19.7109 9.73914 19.1486 11.7229C18.5177 13.9463 19.7589 16.1391 21.7585 16.1391Z" fill="#FFFEFD"/>
            <path d="M20.8437 26.8903C20.3498 26.7537 19.4731 26.6658 18.5555 26.6531C17.5855 26.6389 16.57 26.7084 15.9129 26.8903C14.1382 27.3847 11.7235 26.1886 12.2533 23.7045C12.7434 21.408 14.5042 21.5389 14.9206 19.3625C15.3402 17.163 16.9706 16.1015 18.5555 16.1844C20.0223 16.2614 21.4499 17.3192 21.8389 19.363C22.2529 21.5409 24.0101 21.4088 24.4994 23.7045C25.0312 26.1906 22.6114 27.3802 20.8437 26.8903Z" fill="#FFFEFD"/>
            <path d="M15.4986 16.1393C16.5047 16.1393 17.3687 15.555 17.8489 14.6607C19.2762 12.0014 16.932 8.32 14.2557 9.10841C10.8707 10.1041 11.9437 16.1393 15.4986 16.1393Z" fill="#FFFEFD"/>
            <path d="M13.8909 20.2099C15.033 17.4156 12.3259 14.0023 9.74052 15.0763C6.62626 16.3698 7.99979 21.9487 11.424 21.9487C12.523 21.9487 13.4568 21.2722 13.8909 20.2099Z" fill="#FFFEFD"/>
            <path d="M20.8437 26.8902C20.3497 26.7537 19.473 26.6657 18.5554 26.653V16.1844C20.0223 16.2614 21.4498 17.3192 21.8388 19.363C22.2528 21.5408 24.01 21.4087 24.4994 23.7045C25.0311 26.1905 22.6113 27.3801 20.8437 26.8902Z" fill="#FFFEFD"/>
            </svg>
        </span></a>
    </div>

    <section>
        <div class="container-why">
            <h2 id="section1" style="font-size: 32px; margin-top: 0; margin-bottom: 60px;">Почему мы?</h2>

            <div class="cards">
                <div class="card">
                    <img src="{{asset('container-why-img/иконка.png')}}" alt="icon">
                    <h3>Комфортная температура</h3>
                    <p>Во всех номерах поддерживается комфортная температура в пределах 23 - 25 градусов. В каждом номере можно дополнительно отрегулировать температуру.</p>
                </div>
                <div class="card">
                    <img src="{{asset('container-why-img/иконка (1).png')}}" alt="icon">
                    <h3>Видеонаблюдение</h3>
                    <p>Мы предоставляем доступ в нашу систему. Вы сможете следить за своим питомцем со своего смартфона или компьютера.</p>
                </div>
                <div class="card">
                    <img src="{{asset('container-why-img/иконка (2).png')}}" alt="icon">
                    <h3>Услуги Зоотакси</h3>
                    <p>Мы приедем за вашим питомцем в любой район Санкт-Петербурга.</p>
                </div>
                <div class="card">
                    <img src="{{asset('container-why-img/иконка (3).png')}}" alt="icon">
                    <h3>Сбалансированное питание</h3>
                    <p>Вы можете привезти свой корм или доверить рацион своего питомца нашим профессионалам.</p>
                </div>
                <div class="card">
                    <img src="{{asset('container-why-img/иконка (4).png')}}" alt="icon">
                    <h3>Ежедневные прогулки</h3>
                    <p>По вашему желанию мы выгуливаем вашего питомца два раза в день на специализированной закрытой территории.</p>
                </div>
                <div class="card">
                    <img src="{{asset('container-why-img/иконка (5).png')}}" alt="icon">
                    <h3>Лучшие ветеринары</h3>
                    <p>В гостинице 24 часа дежурит ветеринарный врач, который окажет любую помощь в случае необходимости.</p>
                </div>
            </div>
        </div>
    </section>


        <div class="swiper">
            <div id="slide-1" class="swiper-slide">
                <h2 style="font-size: 32px; margin-top: 0; margin-bottom: 100px;">Номера</h2>
                <div class="room-card">
                    <div class="room-image">
                        <img src="{{ asset('/image/Rectangle 20.png') }}" alt="Эконом плюс">
                    </div>
                    <img style="position: absolute; z-index: -1; margin-top: -500px" src="{{ asset('/image/fish.png') }}" alt="fish">
                    <div class="room-details">
                        <h3>Эконом плюс</h3>
                        <ul>
                            <li>Площадь: 0.90 м²</li>
                            <li>Размеры: 90x100x180 см</li>
                            <li>Цена за сутки: 200₽</li>
                        </ul>
                        <a href="" class="book-button"><p >Забронировать</p> <span><svg width="36" height="36" viewBox="0 0 36 36" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M36.0005 18C36.0005 22.8079 34.1281 27.3277 30.7284 30.7279C27.3295 34.1268 22.8098 35.9992 18.0027 36H18.0005C13.1926 36 8.672 34.1277 5.27255 30.7279C1.87283 27.3277 0.000488281 22.8079 0.000488281 18C0.000488281 13.1921 1.87283 8.67151 5.27255 5.27206C8.672 1.87234 13.1926 0 18.0005 0H18.0027C22.8098 0.000823978 27.3295 1.87317 30.7284 5.27206C34.1281 8.67151 36.0005 13.1921 36.0005 18Z" fill="#FFFEFD"/>
                                <path d="M24.8036 15.5245C21.8392 17.2247 22.344 22.1874 25.5596 22.1874C26.9464 22.1874 28.1467 21.1448 28.6811 19.8119C29.9152 16.7336 27.3488 14.0643 24.8036 15.5245Z" fill="#FF7236"/>
                                <path d="M21.759 16.1391C25.3158 16.1391 26.3808 10.0992 23.0016 9.10618C21.4621 8.65392 19.7114 9.73911 19.1491 11.7228C18.5182 13.9463 19.7594 16.1391 21.759 16.1391Z" fill="#FF7236"/>
                                <path d="M20.8442 26.8903C20.3503 26.7537 19.4736 26.6658 18.556 26.6531C17.586 26.6389 16.5705 26.7084 15.9134 26.8903C14.1387 27.3847 11.724 26.1886 12.2538 23.7045C12.7439 21.408 14.5047 21.5389 14.9211 19.3625C15.3407 17.163 16.9711 16.1015 18.556 16.1844C20.0228 16.2614 21.4504 17.3192 21.8394 19.363C22.2534 21.5409 24.0106 21.4088 24.4999 23.7045C25.0317 26.1906 22.6118 27.3802 20.8442 26.8903Z" fill="#FF7236"/>
                                <path d="M15.4993 16.1393C16.5054 16.1393 17.3695 15.555 17.8496 14.6607C19.2769 12.0014 16.9327 8.32 14.2564 9.10841C10.8715 10.1041 11.9445 16.1393 15.4993 16.1393Z" fill="#FF7236"/>
                                <path d="M13.8914 20.21C15.0335 17.4157 12.3264 14.0024 9.741 15.0764C6.62675 16.3699 8.00028 21.9488 11.4245 21.9488C12.5234 21.9488 13.4573 21.2723 13.8914 20.21Z" fill="#FF7236"/>
                                <path d="M20.8441 26.8903C20.3502 26.7537 19.4735 26.6658 18.5559 26.6531V16.1844C20.0227 16.2614 21.4503 17.3192 21.8393 19.363C22.2533 21.5409 24.0105 21.4088 24.4999 23.7045C25.0316 26.1906 22.6118 27.3802 20.8441 26.8903Z" fill="#FF7236"/>
                                        </svg></span></a>
                    </div>
                </div>
            </div>

            <div id="slide-2" class="swiper-slide hidden">
                <h2 style="font-size: 32px; margin-top: 0; margin-bottom: 100px;">Номера</h2>
                <div class="room-card">
                    <div class="room-image">
                        <img src="{{ asset('/image/Rectangle 20 (1).png') }}" alt="Эконом плюс">
                    </div>
                    <img style="position: absolute; z-index: -1; margin-top: -500px" src="{{ asset('/image/fish.png') }}" alt="fish">
                    <div class="room-details">
                        <h3>Комфорт</h3>
                        <ul>
                            <li>Площадь: 1.13 м²</li>
                            <li>Размеры: 100x125x180 см</li>
                            <li>Цена за сутки: 250₽</li>
                        </ul>
                        <a href="" class="book-button"><p >Забронировать</p> <span><svg width="36" height="36" viewBox="0 0 36 36" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M36.0005 18C36.0005 22.8079 34.1281 27.3277 30.7284 30.7279C27.3295 34.1268 22.8098 35.9992 18.0027 36H18.0005C13.1926 36 8.672 34.1277 5.27255 30.7279C1.87283 27.3277 0.000488281 22.8079 0.000488281 18C0.000488281 13.1921 1.87283 8.67151 5.27255 5.27206C8.672 1.87234 13.1926 0 18.0005 0H18.0027C22.8098 0.000823978 27.3295 1.87317 30.7284 5.27206C34.1281 8.67151 36.0005 13.1921 36.0005 18Z" fill="#FFFEFD"/>
                                <path d="M24.8036 15.5245C21.8392 17.2247 22.344 22.1874 25.5596 22.1874C26.9464 22.1874 28.1467 21.1448 28.6811 19.8119C29.9152 16.7336 27.3488 14.0643 24.8036 15.5245Z" fill="#FF7236"/>
                                <path d="M21.759 16.1391C25.3158 16.1391 26.3808 10.0992 23.0016 9.10618C21.4621 8.65392 19.7114 9.73911 19.1491 11.7228C18.5182 13.9463 19.7594 16.1391 21.759 16.1391Z" fill="#FF7236"/>
                                <path d="M20.8442 26.8903C20.3503 26.7537 19.4736 26.6658 18.556 26.6531C17.586 26.6389 16.5705 26.7084 15.9134 26.8903C14.1387 27.3847 11.724 26.1886 12.2538 23.7045C12.7439 21.408 14.5047 21.5389 14.9211 19.3625C15.3407 17.163 16.9711 16.1015 18.556 16.1844C20.0228 16.2614 21.4504 17.3192 21.8394 19.363C22.2534 21.5409 24.0106 21.4088 24.4999 23.7045C25.0317 26.1906 22.6118 27.3802 20.8442 26.8903Z" fill="#FF7236"/>
                                <path d="M15.4993 16.1393C16.5054 16.1393 17.3695 15.555 17.8496 14.6607C19.2769 12.0014 16.9327 8.32 14.2564 9.10841C10.8715 10.1041 11.9445 16.1393 15.4993 16.1393Z" fill="#FF7236"/>
                                <path d="M13.8914 20.21C15.0335 17.4157 12.3264 14.0024 9.741 15.0764C6.62675 16.3699 8.00028 21.9488 11.4245 21.9488C12.5234 21.9488 13.4573 21.2723 13.8914 20.21Z" fill="#FF7236"/>
                                <path d="M20.8441 26.8903C20.3502 26.7537 19.4735 26.6658 18.5559 26.6531V16.1844C20.0227 16.2614 21.4503 17.3192 21.8393 19.363C22.2533 21.5409 24.0105 21.4088 24.4999 23.7045C25.0316 26.1906 22.6118 27.3802 20.8441 26.8903Z" fill="#FF7236"/>
                                        </svg></span></a>
                    </div>
                </div>
            </div>

            <div id="slide-3" class="swiper-slide hidden"><h2 style="font-size: 32px; margin-top: 0; margin-bottom: 100px;">Номера</h2>
                <div class="room-card">
                    <div class="room-image">
                        <img src="{{ asset('/image/Rectangle 20 (2).png') }}" alt="Эконом плюс">
                    </div>
                    <img style="position: absolute; z-index: -1; margin-top: -500px" src="{{ asset('/image/fish.png') }}" alt="fish">
                    <div class="room-details">
                        <h3>Сьют</h3>
                        <ul>
                            <li>Площадь: 1,56 м²</li>
                            <li>Размеры: 125x125x180 см</li>
                            <li>Цена за сутки: 350₽</li>
                        </ul>
                        <a href="" class="book-button"><p >Забронировать</p> <span><svg width="36" height="36" viewBox="0 0 36 36" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M36.0005 18C36.0005 22.8079 34.1281 27.3277 30.7284 30.7279C27.3295 34.1268 22.8098 35.9992 18.0027 36H18.0005C13.1926 36 8.672 34.1277 5.27255 30.7279C1.87283 27.3277 0.000488281 22.8079 0.000488281 18C0.000488281 13.1921 1.87283 8.67151 5.27255 5.27206C8.672 1.87234 13.1926 0 18.0005 0H18.0027C22.8098 0.000823978 27.3295 1.87317 30.7284 5.27206C34.1281 8.67151 36.0005 13.1921 36.0005 18Z" fill="#FFFEFD"/>
                                <path d="M24.8036 15.5245C21.8392 17.2247 22.344 22.1874 25.5596 22.1874C26.9464 22.1874 28.1467 21.1448 28.6811 19.8119C29.9152 16.7336 27.3488 14.0643 24.8036 15.5245Z" fill="#FF7236"/>
                                <path d="M21.759 16.1391C25.3158 16.1391 26.3808 10.0992 23.0016 9.10618C21.4621 8.65392 19.7114 9.73911 19.1491 11.7228C18.5182 13.9463 19.7594 16.1391 21.759 16.1391Z" fill="#FF7236"/>
                                <path d="M20.8442 26.8903C20.3503 26.7537 19.4736 26.6658 18.556 26.6531C17.586 26.6389 16.5705 26.7084 15.9134 26.8903C14.1387 27.3847 11.724 26.1886 12.2538 23.7045C12.7439 21.408 14.5047 21.5389 14.9211 19.3625C15.3407 17.163 16.9711 16.1015 18.556 16.1844C20.0228 16.2614 21.4504 17.3192 21.8394 19.363C22.2534 21.5409 24.0106 21.4088 24.4999 23.7045C25.0317 26.1906 22.6118 27.3802 20.8442 26.8903Z" fill="#FF7236"/>
                                <path d="M15.4993 16.1393C16.5054 16.1393 17.3695 15.555 17.8496 14.6607C19.2769 12.0014 16.9327 8.32 14.2564 9.10841C10.8715 10.1041 11.9445 16.1393 15.4993 16.1393Z" fill="#FF7236"/>
                                <path d="M13.8914 20.21C15.0335 17.4157 12.3264 14.0024 9.741 15.0764C6.62675 16.3699 8.00028 21.9488 11.4245 21.9488C12.5234 21.9488 13.4573 21.2723 13.8914 20.21Z" fill="#FF7236"/>
                                <path d="M20.8441 26.8903C20.3502 26.7537 19.4735 26.6658 18.5559 26.6531V16.1844C20.0227 16.2614 21.4503 17.3192 21.8393 19.363C22.2533 21.5409 24.0105 21.4088 24.4999 23.7045C25.0316 26.1906 22.6118 27.3802 20.8441 26.8903Z" fill="#FF7236"/>
                                        </svg></span></a>
                    </div>
                </div>
            </div>

        </div>
        <div class="group-btn">
            <div class="pagination">
                <span class="dot active" data-slide="0"></span>
                <span class="dot" data-slide="1"></span>
                <span class="dot" data-slide="2"></span>
            </div>

            <!-- Навигация түймелері -->
            <div class="group-btn_mini">
                <button class="btnslide" id="prev-button"><span><svg width="60" height="60" viewBox="0 0 60 60" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <g filter="url(#filter0_d_10_75)">
                            <circle cx="30.0005" cy="28" r="18" fill="white"/>
                        </g>
                        <path d="M31.0005 24L27.0005 28L31.0005 32" stroke="#FF7236" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                        <defs>
                            <filter id="filter0_d_10_75" x="0.000488281" y="0" width="60" height="60" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                                <feFlood flood-opacity="0" result="BackgroundImageFix"/>
                                <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha"/>
                                <feOffset dy="2"/>
                                <feGaussianBlur stdDeviation="6"/>
                                <feColorMatrix type="matrix" values="0 0 0 0 0.679167 0 0 0 0 0.59545 0 0 0 0 0.559826 0 0 0 0.25 0"/>
                                <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_10_75"/>
                                <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_10_75" result="shape"/>
                            </filter>
                        </defs>
                    </svg></span></button>
                <button class="btnslide" id="next-button"><span><svg width="60" height="60" viewBox="0 0 60 60" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <g filter="url(#filter0_d_10_76)">
                            <circle cx="30.0005" cy="28" r="18" fill="white"/>
                        </g>
                        <path d="M29.0005 32L33.0005 28L29.0005 24" stroke="#FF7236" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                        <defs>
                            <filter id="filter0_d_10_76" x="0.000488281" y="0" width="60" height="60" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                                <feFlood flood-opacity="0" result="BackgroundImageFix"/>
                                <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha"/>
                                <feOffset dy="2"/>
                                <feGaussianBlur stdDeviation="6"/>
                                <feColorMatrix type="matrix" values="0 0 0 0 0.679167 0 0 0 0 0.59545 0 0 0 0 0.559826 0 0 0 0.25 0"/>
                                <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_10_76"/>
                                <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_10_76" result="shape"/>
                            </filter>
                        </defs>
                    </svg></span></button>
            </div>
        </div>



@endsection













